# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [19]:
s1 = np.random.randint(1, 5, 100, dtype='l')
s2 = np.random.randint(1, 4, 100, dtype='l')
s3 = np.random.randint(10000, 30001, 100, dtype='l')

In [20]:
s3.max()

29870

In [23]:
type(s1)

numpy.ndarray

In [24]:
s1 = pd.Series(s1)
s2 = pd.Series(s2)
s3 = pd.Series(s3)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [27]:
df = pd.concat([s1, s2, s3], axis=1)
df.head()

   0  1      2
0  2  3  17790
1  3  2  18432
2  2  2  18426
3  2  1  14752
4  3  1  20957

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [26]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df.head()

   bedrs  bathrs  price_sqr_meter
0      2       3            17790
1      3       2            18432
2      2       2            18426
3      2       1            14752
4      3       1            20957

In [30]:
df.rename(columns = {0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'}, inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      2       3            17790
1      3       2            18432
2      2       2            18426
3      2       1            14752
4      3       1            20957

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [33]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
type(bigcolumn)

pandas.core.series.Series

In [34]:
bigcolumn = bigcolumn.to_frame()
type(bigcolumn)

pandas.core.frame.DataFrame

In [35]:
bigcolumn.head()

   0
0  2
1  3
2  2
3  2
4  3

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [37]:
bigcolumn.index.max()

99

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [40]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn.tail()

         0
295  10405
296  26164
297  14280
298  26723
299  23315

In [41]:
bigcolumn.index.max()

299